---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.GetInitialIntensity
source: html/3ac41b1a-a2a8-c15f-6bba-eb41e48006c6.htm
---
# Autodesk.Revit.DB.Lighting.LightType.GetInitialIntensity Method

Return a copy of an object derived from InitialIntensity

## Syntax (C#)
```csharp
public InitialIntensity GetInitialIntensity()
```